---
kind: method
id: M:Autodesk.Revit.DB.RepeaterCoordinates.#ctor(System.Int32,System.Int32)
source: html/a1d83b21-6d25-d270-83a6-b6eee1812f6d.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates.#ctor Method

Creates two dimensional coordinates.

## Syntax (C#)
```csharp
public RepeaterCoordinates(
	int x,
	int y
)
```

## Parameters
- **x** (`System.Int32`) - The coordinate in first dimension.
- **y** (`System.Int32`) - The coordinate in second dimension.